<a href="https://colab.research.google.com/github/Sriharshitha842/ML_LAB/blob/main/ML_lab4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Name of the Student  : Sriharshitha Deepala**

**Reg No :  19BCD7246**

**Course Code : CSE3008**

**Lab No : 04**

# **Implementation Of Random Forest**

In [25]:
#importing libraries
import pandas as pd

In [26]:
#reading csv file
df = pd.read_csv('/content/sample_data/Titanic.csv')
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   129.000000  129.000000  129.000000  ...  129.000000  129.000000  129.000000
mean    956.000000    0.395349    2.286822  ...    0.434109    0.248062   35.954943
std      37.383151    0.490832    0.867772  ...    0.705392    0.649892   59.713837
min     892.000000    0.000000    1.000000  ...    0.000000    0.000000    3.170800
25%     924.000000    0.000000    1.000000  ...    0.000000    0.000000    7.879200
50%     956.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     988.000000    1.000000    3.000000  ...    1.000000    0.000000   28.537500
max    1020.000000    1.000000    3.000000  ...    4.000000    4.000000  263.000000

[8 rows x 7 columns]

In [27]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0          892         0       3  ...   7.8292   NaN         Q
1          893         1       3  ...   7.0000   NaN         S
2          894         0       2  ...   9.6875   NaN         Q
3          895         0       3  ...   8.6625   NaN         S
4          896         1       3  ...  12.2875   NaN         S

[5 rows x 12 columns]

In [28]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df['Sex']=le.fit_transform(df['Sex'].astype(str))
df['Embarked']=le.fit_transform(df['Embarked'].astype(str))
df.drop(['PassengerId'],axis=1,inplace=True)
df.drop(['Name'],axis=1,inplace=True)
df.drop(['Ticket'],axis=1,inplace=True)
df.drop(['Cabin'],axis=1,inplace=True)
df.drop(['Age'],axis=1,inplace=True)
df.head()

   Survived  Pclass  Sex  SibSp  Parch     Fare  Embarked
0         0       3    1      0      0   7.8292         1
1         1       3    0      1      0   7.0000         2
2         0       2    1      0      0   9.6875         1
3         0       3    1      0      0   8.6625         2
4         1       3    0      1      1  12.2875         2

In [29]:
from sklearn.model_selection import train_test_split
#divide the dataset into features and target variables
X = df.iloc[:,1:]
print(X.describe())
Y = df['Survived'].ravel()
#divide the dataset into training and testing data
X_train,X_test,Y_train,Y_test=train_test_split(X,Y,random_state=0)

           Pclass         Sex       SibSp       Parch        Fare    Embarked
count  129.000000  129.000000  129.000000  129.000000  129.000000  129.000000
mean     2.286822    0.604651    0.434109    0.248062   35.954943    1.310078
std      0.867772    0.490832    0.705392    0.649892   59.713837    0.864205
min      1.000000    0.000000    0.000000    0.000000    3.170800    0.000000
25%      1.000000    0.000000    0.000000    0.000000    7.879200    0.000000
50%      3.000000    1.000000    0.000000    0.000000   14.454200    2.000000
75%      3.000000    1.000000    1.000000    0.000000   28.537500    2.000000
max      3.000000    1.000000    4.000000    4.000000  263.000000    2.000000

In [32]:
#fit the training data into RandomForestClassifier
from sklearn.ensemble import RandomForestClassifier
classifier = RandomForestClassifier().fit(X_train, Y_train)

In [33]:
#making prediction
Y_pred = classifier.predict(X_test)

In [34]:
from sklearn.metrics import classification_report, confusion_matrix, accuracy_score
result = confusion_matrix(Y_test, Y_pred)
print("Confusion Matrix:")
print(result)
result1 = classification_report(Y_test, Y_pred)
print("Classification Report:",)
print (result1)
result2 = accuracy_score(Y_test,Y_pred)*100
print("Accuracy:",result2)

Confusion Matrix:
[[18  0]
 [ 0 15]]
Classification Report:
              precision    recall  f1-score   support

           0       1.00      1.00      1.00        18
           1       1.00      1.00      1.00        15

    accuracy                           1.00        33
   macro avg       1.00      1.00      1.00        33
weighted avg       1.00      1.00      1.00        33

Accuracy: 100.0